In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/30/b1/34e849eda90181a07356a3b48c44870c1ddb751ee388daaa1e31285d2203/pandas-1.3.1-cp38-cp38-macosx_10_9_x86_64.whl (11.1MB)
    100% |████████████████████████████████| 11.2MB 1.8MB/s eta 0:00:01
Collecting numpy>=1.17.3 (from pandas)
  Downloading https://files.pythonhosted.org/packages/1e/f4/a7bcb5942458656882195d71df967bc74c01452cb445c10c23c40ca6a8ef/numpy-1.21.1-cp38-cp38-macosx_10_9_x86_64.whl (16.9MB)
    100% |████████████████████████████████| 16.9MB 1.2MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Collecting pytz>=2017.3 (from pandas)
  Using cached https://files.pythonhosted.org/packages/70/94/784178ca5dd892a98f113cdd923372024dc04b8d40abe77ca76b5fb90ca6/pytz-2021.1-py2.py3-none-any.whl
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.21.1 pandas-1.3.1 pytz-2021.1

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [4]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Jack', '24', '178']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  24    178

In [5]:
df['Weight'] = ['75', '80', '77']
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  24    178     77

In [6]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  24    178

In [7]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Jack  24    178     77

In [8]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  24    178

In [9]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [10]:
df = df.drop(2)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [11]:
df['Name']

0    Allen
1      Ted
Name: Name, dtype: object